{"data":{"site":{"siteMetadata":{"title":"Trafikito - monitor output of any command"}},"allMarkdownRemark":{"edges":[{"node":{"excerpt":"Yes  Trafikito is fully compatible with phones and tablets. However,  when making customizations , we recommend using a computer but it’s not a requirement…","frontmatter":{"title":"Can I view the dashboard on my phone or tablet?","uri":"can-i-view-the-dashboard-on-my-phone-or-tablet","tags":["dashboard"]}}},{"node":{"excerpt":"For hobby projects 12 hours is more than enough. With 12 hours you can see what happened while you were sleeping.\n However, for most  businesses 3 days is a…","frontmatter":{"title":"How many hours of logs do I need?","uri":"how-many-hours-of-logs-do-i-need","tags":["dashboard"]}}},{"node":{"excerpt":"Trafikito’s dashboard data, including server list and single server views, are continuously being refreshed in the background. A data refresh is performed every…","frontmatter":{"title":"How often is the data in Trafikito’s dashboard updated?","uri":"how-often-is-the-data-in-trafikito-s-dashboard-updated","tags":["dashboard"]}}},{"node":{"excerpt":"Go to the single server view where you can see the box with text. Turn on the edit mode switch, which is on the bottom left of the single server view. Now you…","frontmatter":{"title":"How to change color of the chart?","uri":"how-to-change-color-of-the-chart","tags":["dashboard"]}}},{"node":{"excerpt":"Go to the single server view where you can see the box with text. Turn on the edit mode switch, which is on the bottom left of the single server view. Now you…","frontmatter":{"title":"How to change default visibility on charts?","uri":"how-to-change-default-visibility-on-charts","tags":["dashboard"]}}},{"node":{"excerpt":"Go to single server view where you can see the box with text. Turn on the edit mode switch, which is on the bottom left of the single server view. Now you can…","frontmatter":{"title":"How to change text in dashboard?","uri":"how-to-change-text-in-dashboard","tags":["dashboard"]}}},{"node":{"excerpt":"Go to the single server view where you will see a number of charts displayed. Turn on the edit mode switch, which is in the bottom-left corner of the single…","frontmatter":{"title":"How to change the layout of the dashboard?","uri":"how-to-change-the-layout-of-the-dashboard","tags":["dashboard"]}}},{"node":{"excerpt":"Go to single server view where you can see the box with the chart. Turn on the edit mode switch, which is on the bottom left of single server view. Now you can…","frontmatter":{"title":"How to change the title or y-axis of the chart?","uri":"how-to-change-the-title-or-y-axis-of-the-chart","tags":["dashboard"]}}},{"node":{"excerpt":"Go to single server view where you can see the box with the chart. Turn on the edit mode switch, which is on the bottom left of single server view. Now you can…","frontmatter":{"title":"How to change y-axis of the chart?","uri":"how-to-change-y-axis-of-the-chart","tags":["dashboard"]}}},{"node":{"excerpt":"Go to single server view where you can see the chart. Turn on the edit mode switch, which is on the bottom left of single server view. Now you can view settings…","frontmatter":{"title":"How to edit the text or chart box in single server view?","uri":"how-to-edit-the-text-or-chart-box-in-single-server-view","tags":["dashboard"]}}},{"node":{"excerpt":"In the single server view above all boxes with text and charts there is an option to select how many hours to view\nby using the arrows to the left and the right…","frontmatter":{"title":"How to navigate in time?","uri":"how-to-navigate-in-time","tags":["dashboard"]}}},{"node":{"excerpt":"Go to single server view where you can see the boxes with text and charts Turn on the edit mode switch, which is on the bottom left of the single server view…","frontmatter":{"title":"How to remove boxes from the dashboard?","uri":"how-to-remove-boxes-from-the-dashboard","tags":["dashboard"]}}},{"node":{"excerpt":"While in the single server view with boxes of text and charts, scroll all the way up to where there is a button \nwith the current selected server name on it…","frontmatter":{"title":"How to switch server on the single server view without going back to the servers list?","uri":"how-to-switch-server-on-the-single-server-view-without-going-back-to-the-servers-list","tags":["dashboard"]}}},{"node":{"excerpt":"The Free plan allows you to view up to 12 hours of logs. Paid plans allows up to  2 weeks of logs . \nWhile in the single server view, click on “Showing 1 hour…","frontmatter":{"title":"How to view more than 1 hour of logs?","uri":"how-to-view-more-than-1-hour-of-logs","tags":["dashboard"]}}},{"node":{"excerpt":"The servers list is a place where you can see an overview of all your servers. It is an initial view of the dashboard.\nTo open the servers list, firstly, open…","frontmatter":{"title":"What are the servers list view on Trafikito dashboard?","uri":"what-are-the-servers-list-view-on-trafikito-dashboard","tags":["dashboard"]}}},{"node":{"excerpt":"A single view layout is fully customizable. It reports whatever makes sense in your case. During installation, Trafikito \ntries to retrieve the usage data of…","frontmatter":{"title":"What data is displayed in the single server view of Trafikito’s dashboard?","uri":"what-data-is-displayed-in-the-single-server-view-of-trafikito-s-dashboard","tags":["dashboard"]}}},{"node":{"excerpt":"During installation, Trafikito will try to get details about all your server’s base resources and generate a dashboard for you. By default, Trafikito checks…","frontmatter":{"title":"What is available in the default single server view?","uri":"what-is-available-in-the-default-single-server-view","tags":["dashboard"]}}},{"node":{"excerpt":"Edit mode is a special mode which enables the editing of a single server view. In this mode, you can add, edit, remove or drag boxes around. Each box has an…","frontmatter":{"title":"What is edit mode?","uri":"what-is-edit-mode","tags":["dashboard"]}}},{"node":{"excerpt":"This view has extended details of the variables being monitored on your server. It can have several types of boxes. \nBoxes with text show the current value of…","frontmatter":{"title":"What is single server view on Trafikito dashboard?","uri":"what-is-single-server-view-on-trafikito-dashboard","tags":["dashboard"]}}},{"node":{"excerpt":"A dashboard is a special place where you can see an overview of all your servers in a workspace. You can extensively\ncheck logs over time and change numerous…","frontmatter":{"title":"What is Trafikito’s Dashboard?","uri":"what-is-trafikito-s-dashboard","tags":["dashboard"]}}},{"node":{"excerpt":"A dashboard is an essential part of Trafikito’s web interface. It shows the current status of your servers in addition\nto log information recorded over time…","frontmatter":{"title":"Why is the dashboard important?","uri":"why-is-the-dashboard-important","tags":["dashboard"]}}},{"node":{"excerpt":"Yes , You can change the name of a variable but if it is in use in charts or text boxes on the dashboard it will not\ndisplay values anymore. You can always fix…","frontmatter":{"title":"Can I change the name of used variables?","uri":"can-i-change-the-name-of-used-variables","tags":["data sources"]}}},{"node":{"excerpt":"Yes . You can change warning and error ranges for all variables that have numeric display type: number, base or percent. Variables with display type strings has…","frontmatter":{"title":"Can I change warn and error ranges?","uri":"can-i-change-warn-and-error-ranges","tags":["data sources"]}}},{"node":{"excerpt":"Yes . While the variable is holding the value of any cell from the parsed output, you can assign several variables to the same cell and both will have the same…","frontmatter":{"title":"Can I have several variables showing the same thing?","uri":"can-i-have-several-variables-showing-the-same-thing","tags":["data sources"]}}},{"node":{"excerpt":"Display type base can be used with numeric values. It can do some basic math and apply suffix to the final number. This is how it works: Let’s say we use df -P…","frontmatter":{"title":"How does options of the display type: base work?","uri":"how-does-options-of-the-display-type-base-work","tags":["data sources"]}}},{"node":{"excerpt":"Display type string  is used to display string values. While it’s not a number, it has no value range or extra display options. It’s the most basic display type…","frontmatter":{"title":"How the display types string, number, base and percent are different?","uri":"how-the-display-types-string-number-base-and-percent-are-different","tags":["data sources"]}}},{"node":{"excerpt":"Login to your machine. You can use SSH, FTP or anything else depending on your machine. Edit this file:  If this file is not available, Trafikito agent is not…","frontmatter":{"title":"How to add a new command?","uri":"how-to-add-a-new-command","tags":["data sources"]}}},{"node":{"excerpt":"Open the main menu on the top left  [ menu icon ] Select  Dashboard In the servers list find the server you want to edit and click  Open  next to it On the top…","frontmatter":{"title":"How to add a new data source?","uri":"how-to-add-a-new-data-source","tags":["data sources"]}}},{"node":{"excerpt":"Open the main menu on the top right  [ menu icon ] Select  Dashboard In the servers list click  Open  next to the server name In the single server view click…","frontmatter":{"title":"How to add new variables?","uri":"how-to-add-new-variables","tags":["data sources"]}}},{"node":{"excerpt":"Warning and error range options define when a value is in a warning or error range. These options can be used with any numeric display type of any variable…","frontmatter":{"title":"How to add or update warning and error ranges?","uri":"how-to-add-or-update-warning-and-error-ranges","tags":["data sources"]}}},{"node":{"excerpt":"Open main menu on the top right  [ menu icon ] Select In the servers list click  Open  next to the server name In single server view click  Settings  on the top…","frontmatter":{"title":"How to delete data sources?","uri":"how-to-delete-data-sources","tags":["data sources"]}}},{"node":{"excerpt":"To monitor a single number you need to finish several steps: Have data source with command to execute on your server. Select from the data sources list or add a…","frontmatter":{"title":"How to monitor a single number from the output of command?","uri":"how-to-monitor-a-single-number-from-the-output-of-command","tags":["data sources"]}}},{"node":{"excerpt":"To change the command name you need to login to your server and update   file. Login to your machine. You can use SSH, FTP or anything else depending on your…","frontmatter":{"title":"How to change the name of a current command?","uri":"how-to-change-the-name-of-a-current-command","tags":["data sources"]}}},{"node":{"excerpt":"All data sources are visible in the settings of the server. Click the  menu  icon on the top left Go to  Dashboard Click  Open  next to the server name you want…","frontmatter":{"title":"How to see data sources?","uri":"how-to-see-data-sources","tags":["data sources"]}}},{"node":{"excerpt":"These chips show all variables configured for each data source. You can see the name of it and the range the current \nvalue is. normal range warning range error…","frontmatter":{"title":"What are chips in the data source list?","uri":"what-are-chips-in-the-data-source-list","tags":["data sources"]}}},{"node":{"excerpt":"Data sources define data input to Trafikito service. Data sources are made of command alias on your server, the output\nof the command, splitting raw output into…","frontmatter":{"title":"What are data sources?","uri":"what-are-data-sources","tags":["data sources"]}}},{"node":{"excerpt":"When the value display type is percent, you can define minimum and maximum values. Let’s say you want to have RAM \navailable as a percent. Let’s say your…","frontmatter":{"title":"What are min and max values for percent display types?","uri":"what-are-min-and-max-values-for-percent-display-types","tags":["data sources"]}}},{"node":{"excerpt":"Variables are placeholders that represent particular values from the output of the command executed on your server. In the data source configuration view, you…","frontmatter":{"title":"What are variables?","uri":"what-are-variables","tags":["data sources"]}}},{"node":{"excerpt":"Warning and error range settings define when numeric value of a variable is in normal, warning or error range. You can add several ranges for each variable with…","frontmatter":{"title":"What are warning and error ranges?","uri":"what-are-warning-and-error-ranges","tags":["data sources"]}}},{"node":{"excerpt":"When Trafikito receives outputs of commands executed on your server it checks how many space the output takes. If the total size of all data is over your plan…","frontmatter":{"title":"What happens if an output is more than your plan limit?","uri":"what-happens-if-an-output-is-more-than-your-plan-limit","tags":["data sources"]}}},{"node":{"excerpt":"To save changes you must click  Save data source  so you can experiment with parsing settings without saving and nothing will be changed. While changing the…","frontmatter":{"title":"What happens if I change the data parsing settings?","uri":"what-happens-if-i-change-the-data-parsing-settings","tags":["data sources"]}}},{"node":{"excerpt":"Every minute the agent running on your server sends data to Trafikito. When the data arrives several things happen: Current available commands list is updated…","frontmatter":{"title":"What happens when new data arrives at Trafikito?","uri":"what-happens-when-new-data-arrives-at-trafikito","tags":["data sources"]}}},{"node":{"excerpt":"Have you noticed that while splitting the output of the command into a table you can use something called  regex ? This means you can use regular expression…","frontmatter":{"title":"What is a regex?","uri":"what-is-a-regex","tags":["data sources"]}}},{"node":{"excerpt":"Data parsing is the required step to split the output of the command, which is the text, into the table. If you want to track numbers available in the output of…","frontmatter":{"title":"What is data parsing?","uri":"what-is-data-parsing","tags":["data sources"]}}},{"node":{"excerpt":"Trafikito gets command output from Linux machines as text. While you need to track some part of the text, e.g. you want to monitor an average load while using…","frontmatter":{"title":"What is data splitting inside data source configuration?","uri":"what-is-data-splitting-inside-data-source-configuration","tags":["data sources"]}}},{"node":{"excerpt":"Display type determines how to display the value in different parts of a dashboard or in the notification. There are 4 available display values: string number…","frontmatter":{"title":"What is the display type for the variable?","uri":"what-is-the-display-type-for-the-variable","tags":["data sources"]}}},{"node":{"excerpt":"Deleting data sources will delete it’s variables and logs. Logs and variables are removed for this data source only. Other data sources will be kept unmodified…","frontmatter":{"title":"What will happen if I delete a data source which is in use?","uri":"what-will-happen-if-i-delete-a-data-source-which-is-in-use","tags":["data sources"]}}},{"node":{"excerpt":"When you have numeric values to track and it needs to be divided by some base. You can also add some suffix next to the value. A good example is the  size of…","frontmatter":{"title":"When to use base display types?","uri":"when-to-use-base-display-types","tags":["data sources"]}}},{"node":{"excerpt":"When you have a numeric value and you want to set how many decimal places it should display on the dashboard and also you want to define warning and error…","frontmatter":{"title":"When to use number display types?","uri":"when-to-use-number-display-types","tags":["data sources"]}}},{"node":{"excerpt":"When you have a numeric value and want to get percentage representation of it. Just like all numeric types, you can set error and warning ranges for this type…","frontmatter":{"title":"When to use percent display types?","uri":"when-to-use-percent-display-types","tags":["data sources"]}}},{"node":{"excerpt":"When you want to have unmodified values on your dashboard. Display type text doesn’t have options to modify values in any way. It will just use raw values from…","frontmatter":{"title":"When to use string display types?","uri":"when-to-use-string-display-types","tags":["data sources"]}}},{"node":{"excerpt":"For higher security standards. By using only alias commands on your server Trafikito ensures that no unexpected commands run. Imagine losing your login details…","frontmatter":{"title":"Why do all commands start with trafikito_?","uri":"why-do-all-commands-start-with-trafikito","tags":["data sources"]}}},{"node":{"excerpt":"Just wait a few minutes and refresh the view. If Trafikito agent is installed on your server, data comes once per minute. So, it’s best to wait a few minutes…","frontmatter":{"title":"Why is there no sample output?","uri":"why-is-there-no-sample-output","tags":["data sources"]}}},{"node":{"excerpt":"Yes  you can. You can use any variable placeholders inside the body, URL or header value fields. Placeholders will be\nreplaced with actual value on a fly. Below…","frontmatter":{"title":"Can I get the current value of a variable to my email?","uri":"can-i-get-the-current-value-of-a-variable-to-my-email","tags":["notifications"]}}},{"node":{"excerpt":"\r\n**Yes**. Open the notification you want to edit, click on the switch to turn a _when_ case off and save the notification. Notice that the notification has a global on/off switch before the name of the notification and individual on/off switches for each _when_ case.\r\n\r\n","frontmatter":{"title":"Can I turn on/off the notification for a single when case?","uri":"can-i-turn-on-off-the-notification-for-a-single-when-case","tags":["notifications"]}}},{"node":{"excerpt":"\r\nYou can send any text to API endpoint. To send JSON, use raw body type and add header _content-type: application/json_.\r\n\r\n","frontmatter":{"title":"How can I send JSON to API endpoint with notifications settings?","uri":"how-can-i-send-json-to-api-endpoint-with-notifications-settings","tags":["notifications"]}}},{"node":{"excerpt":"7 days counting from the initial call. You can see a maximum of 15 last logs for API calls and each log is saved for 7 days.","frontmatter":{"title":"How long will notification logs for API calls be available?","uri":"how-long-will-notification-logs-for-api-calls-be-available","tags":["notifications"]}}},{"node":{"excerpt":"\r\nThere is no limit for the amount of _when_ cases each notification may have but there is an overall limit for the amount of _when_ cases each server in a workspace may have. It depends on your current plan.\r\n\r\n","frontmatter":{"title":"How many when cases notifications may I have?","uri":"how-many-when-cases-notifications-may-i-have","tags":["notifications"]}}},{"node":{"excerpt":"\r\nEach notification must have at least one _when_ case to be fired. Trafikito recommends adding several _when_ cases for each notification call; so you will not need to configure the same notification action several times. To add a _when_ case to notifications follow these steps:\r\n\r\n","frontmatter":{"title":"How to add a new when case to notifications?","uri":"how-to-add-a-new-when-case-to-notifications","tags":["notifications"]}}},{"node":{"excerpt":"All variables are defined in the data source settings. If you want to add, remove or edit variables you’ll need to go to\ndata sources and do the changes there.","frontmatter":{"title":"How to add new variables in the notification options?","uri":"how-to-add-new-variables-in-the-notification-options","tags":["notifications"]}}},{"node":{"excerpt":"\r\nYou can add many notifications for each server for free. This is the list of all actions needed to add new notifications:\r\n\r\n","frontmatter":{"title":"How to add notifications?","uri":"how-to-add-notifications","tags":["notifications"]}}},{"node":{"excerpt":"\r\nIn the notifications list you can see an overview of all when cases and stay in range values. Note that not all when cases in the notification may have a save value of “stay in range”.\r\n\r\n","frontmatter":{"title":"How to change “stay in range” value for all notifications at once?","uri":"how-to-change-stay-in-range-value-for-all-notifications-at-once","tags":["notifications"]}}},{"node":{"excerpt":"\r\nIn the notifications list you can see an overview of all _when_ cases and “wait before firing again” values. Observe that not all _when_ cases in the notification may have a save value of “wait before firing again”.\r\n\r\n","frontmatter":{"title":"How to change “wait before firing again” value for all notifications at once?","uri":"how-to-change-wait-before-firing-again-value-for-all-notifications-at-once","tags":["notifications"]}}},{"node":{"excerpt":"\r\nIn the notifications list you can select several notifications and delete them all at once. This mass action will delete the selected notifications without modifying anything else. This action is permanent and cannot be undone. You will have to confirm deletion after clicking Delete. \r\n\r\n","frontmatter":{"title":"How to delete several notifications?","uri":"how-to-delete-several-notifications","tags":["notifications"]}}},{"node":{"excerpt":"\r\nYou can delete one or more notifications at the same time. To remove a single notification follow these steps:\r\n\r\n","frontmatter":{"title":"How to delete notifications?","uri":"how-to-delete-notifications","tags":["notifications"]}}},{"node":{"excerpt":"\r\nAt Trafikito notifications are made of 2 parts:\r\n\r\n1.  When cases\r\n2.  Action to do\r\n\r\n","frontmatter":{"title":"How to make a custom API call after an event?","uri":"how-to-make-a-custom-api-call-after-an-event","tags":["notifications"]}}},{"node":{"excerpt":"To see notification logs of calls, follow steps below. You will see up to 10 last logs for the past 14 days. If there are no logs, then notifications were not fired recently. You can click “Test” and it will fire a notification action in the same manner it would in an event.\r\n\r\n","frontmatter":{"title":"How to see notification logs of API calls?","uri":"how-to-see-notification-logs-of-api-calls","tags":["notifications"]}}},{"node":{"excerpt":"When you edit a notification settings, click “**Save notification**” first to save any edits. Then click “**Test**”, it will make an API call just like it would during an event. You will not only test the action but you will also get results after the test is done.\r\n\r\n","frontmatter":{"title":"How to test notifications?","uri":"how-to-test-notifications","tags":["notifications"]}}},{"node":{"excerpt":"\r\nIn notifications list you can select several notifications and turn them off all at once. This mass action will turn off selected notifications completely without modifying individual _when_ cases.\r\n\r\n","frontmatter":{"title":"How to turn off all notifications?","uri":"how-to-turn-off-all-notifications","tags":["notifications"]}}},{"node":{"excerpt":"\r\nYou can turn on or off notifications or when cases exclusively. To turn off a single notification or when case follow these steps:\r\n\r\n","frontmatter":{"title":"How to turn off several notifications at once?","uri":"how-to-turn-off-several-notifications-at-once","tags":["notifications"]}}},{"node":{"excerpt":"\r\nIn the notifications list you can select several notifications and turn them on all at once. This mass action will turn on selected notifications without modifying individual _when_ cases. If the notification doesn’t have any _when_ cases or all cases are turned off individually - the notification will do nothing.\r\n\r\n","frontmatter":{"title":"How to turn on all notifications?","uri":"how-to-turn-on-all-notifications","tags":["notifications"]}}},{"node":{"excerpt":"\r\nWhile creating notifications you have to add when cases. When cases define when to trigger the action of notifications. If the action type is set to _Getting data_ or _Not getting data_ you will get these options to make adjustments:\r\n\r\n","frontmatter":{"title":"Options when the action type for the when case is getting or not getting data?","uri":"options-when-the-action-type-for-the-when-case-is-getting-or-not-getting-data","tags":["notifications"]}}},{"node":{"excerpt":"\r\nWhile creating notifications you have to add some _when_ cases. When cases defines _when_ to trigger the action of notifications. If the action type is set to a _Variable in a range_ you will get these options to make adjustments:\r\n\r\n","frontmatter":{"title":"Options when the action type for when cases are variables in ranges?","uri":"options-when-the-action-type-for-when-cases-are-variables-in-ranges","tags":["notifications"]}}},{"node":{"excerpt":"\r\nHeaders are parts of any HTTP call over the internet. You can set custom headers to make any API calls needed. It may be authorization headers, content type or anything else.\r\n\r\n","frontmatter":{"title":"What are API call headers?","uri":"what-are-api-call-headers","tags":["notifications"]}}},{"node":{"excerpt":"\nMass actions allow you to edit multiple notifications at once. To do it, follow these steps:\n\n","frontmatter":{"title":"What are mass actions?","uri":"what-are-mass-actions","tags":["notifications"]}}},{"node":{"excerpt":"\r\nNotifications are actions that occur after specific events. The default action is to send an email but it can be an API call. Each notification is made of 2 parts:\r\n\r\n","frontmatter":{"title":"What are notifications?","uri":"what-are-notifications","tags":["notifications"]}}},{"node":{"excerpt":"\r\nYou can detect any possible value of a selected variable range change. You can select these ranges in the when case options while editing notifications.\r\n\r\n","frontmatter":{"title":"What are possible range changes to detect?","uri":"what-are-possible-range-changes-to-detect","tags":["notifications"]}}},{"node":{"excerpt":"Getting or not getting for  specified minutes. You can select how long to wait before firing actions. The minimum amount is 5 minutes because it’s ok if your…","frontmatter":{"title":"What are the options for an action type: getting and not getting data?","uri":"what-are-the-options-for-an-action-type-getting-and-not-getting-data","tags":["notifications"]}}},{"node":{"excerpt":"Variable  - you have to select an existing variable to track from data sources Range change  - you have to select one of the range change events Stay in range…","frontmatter":{"title":"What are the options for an action type: variable in ranges?","uri":"what-are-the-options-for-an-action-type-variable-in-ranges","tags":["notifications"]}}},{"node":{"excerpt":"\r\nWhen cases are a set of options that define situations when notifications should be fired. Each when case has a selected action type:\r\n\r\n","frontmatter":{"title":"What are when cases & how do they work?","uri":"what-are-when-cases-how-do-they-work","tags":["notifications"]}}},{"node":{"excerpt":"There’s no side effects . You will just lose that particular notification and it will be deleted permanently. Also, the logs will be deleted and you will not be…","frontmatter":{"title":"What happens if I delete a notification?","uri":"what-happens-if-i-delete-a-notification","tags":["notifications"]}}},{"node":{"excerpt":"There’s no side effects . You will have to click “Save notification” under all settings to save all modifications.","frontmatter":{"title":"What happens if I delete a when case in notification settings?","uri":"what-happens-if-i-delete-a-when-case-in-notification-settings","tags":["notifications"]}}},{"node":{"excerpt":"\r\nThis is the HTTP method used to call API endpoint. Most popular methods are POST and GET but for rare cases you may need others. Trafikito gives you an option to select whatever is needed, so you could make any API call in an event.\r\n\r\n","frontmatter":{"title":"What is a notification action method?","uri":"what-is-a-notification-action-method","tags":["notifications"]}}},{"node":{"excerpt":"\r\nA notification name is used to easily manage notifications. You can see the notification name in the notifications list on the UI. If you’d like to update the name, then follow these steps:\r\n\r\n","frontmatter":{"title":"What is a notification name?","uri":"what-is-a-notification-name","tags":["notifications"]}}},{"node":{"excerpt":"\r\nA notification URL is the API endpoint where a request will be sent to configure when a notification is fired. Trafikito will submit headers and body if those are defined.\r\n\r\n","frontmatter":{"title":"What is a notification url?","uri":"what-is-a-notification-url","tags":["notifications"]}}},{"node":{"excerpt":"\r\nAn action body is content sent to the endpoint. You can choose to enter HTML - you will see an editor to make text bold, italic, aligned and other popular options. You can switch to raw if you want to send JSON.\r\n\r\n","frontmatter":{"title":"What is an action body?","uri":"what-is-an-action-body","tags":["notifications"]}}},{"node":{"excerpt":"\r\nAPI calls are programmable calls for services on the internet. It is very comparable to how people navigate the internet with a browser. However, API calls don’t require a user interface to navigate it. It is pure data, transferable from one machine to another.\r\n\r\n","frontmatter":{"title":"What is an API call?","uri":"what-is-an-api-call","tags":["notifications"]}}},{"node":{"excerpt":"\r\nAn email template is a 1-click solution when you want your action to be an email message. You can change who gets the email in the workspace settings . While actions in notifications is any API call, Trafikito provides custom endpoint to send an email. When you click to use email templates, an action form will be filled with all the required details: Method, URL, Headers.\r\n\r\n","frontmatter":{"title":"What is email templates?","uri":"what-is-email-templates","tags":["notifications"]}}},{"node":{"excerpt":"\r\nEach when case is made of action types and the settings depend on the action type. Possible action types are:\r\n\r\n","frontmatter":{"title":"What is the difference between action types- getting data, not getting data and variable in ranges?","uri":"what-is-the-difference-between-action-types-getting-data-not-getting-data-and-variable-in-ranges","tags":["notifications"]}}},{"node":{"excerpt":"\r\n**HTML** allows the use of WYSIWYG editor to input text or variables. With WYSIWYG you have control to make text bold, italic, change text color, align, make a list, table and much more. It is a great way for things like formatting an email.\r\n\r\n","frontmatter":{"title":"What is the difference between HTML and Raw body?","uri":"what-is-the-difference-between-html-and-raw-body","tags":["notifications"]}}},{"node":{"excerpt":"In the notifications list, notifications that are turned off have a red background. Turn notification on and it will lose the red color.","frontmatter":{"title":"Why are some notifications red?","uri":"why-are-some-notifications-red","tags":["notifications"]}}},{"node":{"excerpt":"Workspaces can have only one owner at any given time but may have one or more admins.","frontmatter":{"title":"Can a workspace have several owners & admins?","uri":"can-a-workspace-have-several-owners-admins","tags":["workspace"]}}},{"node":{"excerpt":"Yes, you can. You can join several workspaces at once.","frontmatter":{"title":"Can I be a member of several workspaces at once?","uri":"can-i-be-a-member-of-several-workspaces-at-once","tags":["workspace"]}}},{"node":{"excerpt":"No . Paid invoices are in view only mode and can not be edited or removed.","frontmatter":{"title":"Can I edit a paid invoice?","uri":"can-i-edit-a-paid-invoice","tags":["workspace"]}}},{"node":{"excerpt":"No . We do not facilitate refunds because we offer the option of using Trafikito for free for any period of time. So you should only buy a paid plan only when…","frontmatter":{"title":"Can I get a refund?","uri":"can-i-get-a-refund","tags":["workspace"]}}},{"node":{"excerpt":"Yes , you can. Just ensure that the billing profile is filled out with the company details.","frontmatter":{"title":"Can I get an invoice for a company?","uri":"can-i-get-an-invoice-for-a-company","tags":["workspace"]}}},{"node":{"excerpt":"Yes . Trafikito has a great  free plan  orientated to individuals or one-person companies. The Free plan will provide you with a great 1-minute log interval, 2…","frontmatter":{"title":"Can I use Trafikito for free?","uri":"can-i-use-trafikito-for-free","tags":["workspace"]}}},{"node":{"excerpt":"If you are not an owner of the workspace, you have to be an active member of it. Ask someone from the workspace with an admin or owner role to activate your…","frontmatter":{"title":"Can not login to the workspace","uri":"can-not-login-to-the-workspace","tags":["workspace"]}}},{"node":{"excerpt":"\r\nThere is no one way to get a discount coupon. We release from time to time in different ways. During special events or random days that we may announce giveaways on our dashboard or homepage.\r\n\r\n","frontmatter":{"title":"How can I get a discount coupon?","uri":"how-can-i-get-a-discount-coupon","tags":["workspace"]}}},{"node":{"excerpt":"\r\nYou can generate a new invoice that's due or get already paid invoices at the pricing tab in the workspace configuration dialog. Follow these steps to find an invoice:\r\n\r\n","frontmatter":{"title":"How can I get my invoice?","uri":"how-can-i-get-my-invoice","tags":["workspace"]}}},{"node":{"excerpt":"\r\nThe loyalty program allows you to save money on paid plans; especially for users who use Trafikito for an extended period of time. Also, it is permanent and can be added to other discounts. The maximum sum of all discounts is 50%.\r\n\r\n","frontmatter":{"title":"How does the loyalty program work?","uri":"how-does-the-loyalty-program-work","tags":["workspace"]}}},{"node":{"excerpt":"\r\nOnly active members can login to the workspace. Owners cannot be deactivated. To deactivate a member from the active workspace, follow these steps:\r\n\r\n","frontmatter":{"title":"How to activate/deactivate a member from the workspace?","uri":"how-to-activate-deactivate-a-member-from-the-workspace","tags":["workspace"]}}},{"node":{"excerpt":"\r\nWorkspaces may have from 1 to 30 members. To add a new member you must have an admin role or owner role and you will need to add the person’s email.\r\n\r\n","frontmatter":{"title":"How to add a new member to the workspace?","uri":"how-to-add-a-new-member-to-the-workspace","tags":["workspace"]}}},{"node":{"excerpt":"\r\nOn the servers list, above all of the servers, click on the current workspace and in the workspace tab you will find the drop-down to switch to another workspace or create a new one.\r\n\r\n","frontmatter":{"title":"How to add a new workspace?","uri":"how-to-add-a-new-workspace","tags":["workspace"]}}},{"node":{"excerpt":"\r\nA default notification email is the same email that was used by the person who created the workspace. You can change this email to anything at any time.\r\n\r\n","frontmatter":{"title":"How to change a default notification email?","uri":"how-to-change-a-default-notification-email","tags":["workspace"]}}},{"node":{"excerpt":"\r\nThere are 3 member roles: owner, admin, and member. Owners and admins can switch the role of any user between an admin and member. Members cannot make any updates. Only the owner can set a new owner. To change the role of any member, follow these steps:\r\n\r\n","frontmatter":{"title":"How to change member roles?","uri":"how-to-change-member-roles","tags":["workspace"]}}},{"node":{"excerpt":"\r\n1.  Open the main menu on the top left \\[menu icon\\]\r\n2.  Select **Dashboard**\r\n3.  On top of the servers list, you can see the name of the selected workspace. Click it to open more details\r\n4.  On the top select the **Workspace** tab\r\n5.  Check if the **Billing profile** is expanded\r\n6.  Make the required changes\r\n7.  To save the changes click **Save workspace**\r\n\r\n","frontmatter":{"title":"How to change the billing profile?","uri":"how-to-change-the-billing-profile","tags":["workspace"]}}},{"node":{"excerpt":"\r\n1.  Open the main menu on the top left \\[menu icon\\]\r\n2.  Select **Dashboard**\r\n3.  On top of the servers list, you can see the name of the selected workspace. Click it to open more details\r\n4.  On the top select the **Workspace** tab\r\n5.  Check if the **Workspace settings** are expanded and edit the **Workspace name**\r\n6.  To save the changes click **Save workspace**\r\n\r\n","frontmatter":{"title":"How to change the workspace name?","uri":"how-to-change-the-workspace-name","tags":["workspace"]}}},{"node":{"excerpt":"\r\nBasic workspace settings can be found by following these steps:\r\n\r\n","frontmatter":{"title":"How to change the workspace settings?","uri":"how-to-change-the-workspace-settings","tags":["workspace"]}}},{"node":{"excerpt":"\r\n1.  Make sure you have at least one active server in the free workspace. Each day you will get 0.02% for it.\r\n2.  If you work in a company, recommend Trafikito to monitor their servers and when they buy a paid plan you will get your extra personal discount each day.\r\n3.  Join several companies and suggest Trafikito to them. You will get an extra 0.04% everyday for each.\r\n\r\n","frontmatter":{"title":"How to quickly earn personal discounts?","uri":"how-to-quickly-earn-personal-discounts","tags":["workspace"]}}},{"node":{"excerpt":"\r\nIf your role is an “owner” or “admin” you can disable the login of any current user in a workspace. Just use the switch next to the email of the member. A grey color means a user is not able to login. Follow these steps to do it:\r\n\r\n","frontmatter":{"title":"How to remove a member from the workspace?","uri":"how-to-remove-a-member-from-the-workspace","tags":["workspace"]}}},{"node":{"excerpt":"This action can’t be undone . Please note that ONLY the  owner  can remove a workspace. When a workspace is removed all related details are removed: Members…","frontmatter":{"title":"How to remove a workspace?","uri":"how-to-remove-a-workspace","tags":["workspace"]}}},{"node":{"excerpt":"You can switch between the paid plans at any moment. If you have a paid plan that has not expired as yet, you can not switch to the free plan. When switching…","frontmatter":{"title":"How to switch a price plan?","uri":"how-to-switch-a-price-plan","tags":["workspace"]}}},{"node":{"excerpt":"\r\nFor most, the main differences between the free and paid plans are:\r\n\r\n","frontmatter":{"title":"What are the benefits of paid plans?","uri":"what-are-the-benefits-of-paid-plans","tags":["workspace"]}}},{"node":{"excerpt":"\r\nUser roles are permission policies that determine what the identity can and cannot do. There are 3 member roles: owner, admin, and member. Owners and admins can switch the role of any user between an admin and member. Members cannot make any updates. Only the owner can set a new owner.\r\n\r\n","frontmatter":{"title":"What are the member roles?","uri":"what-are-the-member-roles","tags":["workspace"]}}},{"node":{"excerpt":"Only the owner can login to the workspace. As well as all limits are downgraded to the free plan. As a result, you may experience a broken dashboard if your…","frontmatter":{"title":"What happens when a paid plan expires?","uri":"what-happens-when-a-paid-plan-expires","tags":["workspace"]}}},{"node":{"excerpt":"When you try to make changes, then try to save it but you don’t have the required role to save changes, Trafikito shows messages that your role is insufficient.","frontmatter":{"title":"How to add a new workspace?","uri":"what-does-insufficient-role-mean","tags":["workspace"]}}},{"node":{"excerpt":"\nA workspace is a place where you can add several servers in order to have all of them on the same list. You can add members to the workspace and work together. \n\n","frontmatter":{"title":"What is a workspace?","uri":"what-is-a-workspace","tags":["workspace"]}}},{"node":{"excerpt":"\r\nOn the servers list above all of the servers, click on the current workspace and in the Workspace tab, you will find the drop-down to switch to another workspace or create a new one.\r\n\r\n","frontmatter":{"title":"Where is the workspace switcher and how to make changes to an active workspace?","uri":"where-is-the-workspace-switcher-and-how-to-make-changes-to-an-active-workspace","tags":["workspace"]}}},{"node":{"excerpt":"\r\nIt depends on what you do. For many, the free plan is enough but if you need members management and have several persons working in the same workspace, then you will need one of the paid plans.\r\n\r\n","frontmatter":{"title":"Which price plan is best for me?","uri":"which-price-plan-is-best-for-me","tags":["workspace"]}}},{"node":{"excerpt":"Any active member who has an  admin  or  owner  role.","frontmatter":{"title":"Who can change the workspace settings?","uri":"who-can-change-the-workspace-settings","tags":["workspace"]}}},{"node":{"excerpt":"Anyone. Invoices can be paid by any member of the team. Each invoice has a unique ID which identifies when it’s paid; it is not essential for Trafikito to…","frontmatter":{"title":"Who can pay for the invoice?","uri":"who-can-pay-for-the-invoice","tags":["workspace"]}}},{"node":{"excerpt":"All active members of the workspace.","frontmatter":{"title":"Who can see workspace invoices?","uri":"who-can-see-workspace-invoices","tags":["workspace"]}}},{"node":{"excerpt":"\nWhen you register for the first time, an initial workspace is created for you and you are the owner of it. You can always see who is the owner of an active workspace.\n\n","frontmatter":{"title":"Who owns the workspace?","uri":"who-owns-the-workspace","tags":["workspace"]}}},{"node":{"excerpt":"When you want to separate servers and members from another workspace. E.g. your hobby projects may be in your personal workspace while the company you work with…","frontmatter":{"title":"Why create a workspace?","uri":"why-create-a-workspace","tags":["workspace"]}}},{"node":{"excerpt":"In particular sections, Trafikito shows a warning message that a member must be the owner or admin. It means that your role is insufficient for that specific…","frontmatter":{"title":"Why does it say “Must be owner or admin”?","uri":"why-does-it-say-must-be-owner-or-admin","tags":["workspace"]}}},{"node":{"excerpt":"No . Registration is free and Trafikito provides a great free plan without a trial period.  If you decide to upgrade to a paid plan, you will need to select an…","frontmatter":{"title":"Do I need a credit card to register?","uri":"do-i-need-a-credit-card-to-register","tags":["account"]}}},{"node":{"excerpt":"Yes . Login to Trafikito and navigate to this URL:  https://trafikito.com/user/account/update-details There is a form and one of the fields is  Email .  Update…","frontmatter":{"title":"Can I change my email?","uri":"can-i-change-my-email","tags":["account"]}}},{"node":{"excerpt":"To change your password, you must login to Trafikito client and navigate here:  Change password Just enter the current password, then the new password and click…","frontmatter":{"title":"How to change my password?","uri":"how-to-change-my-password","tags":["account"]}}},{"node":{"excerpt":"You can delete all your data at any time.  Login to Trafikito and on your account page you will find the option to\ndelete your account.  Follow these steps to…","frontmatter":{"title":"How to delete all my data and account?","uri":"how-to-delete-all-my-data-and-account","tags":["account"]}}},{"node":{"excerpt":"Registration is free and quick. You will only need your  Google account  or any email address. Name  - your name Country  - your country Email  - the email used…","frontmatter":{"title":"How to register?","uri":"how-to-register","tags":["account"]}}},{"node":{"excerpt":"This is a 3 steps process which starts here:  Recover password Enter your email which you used to register and click  Request new password . You will  get an…","frontmatter":{"title":"I forgot my password, how can I get a new one?","uri":"i-forgot-my-password-how-can-i-get-a-new-one","tags":["account"]}}}]}},"pageContext":{}}