{"data":{"site":{"siteMetadata":{"title":"Trafikito - monitor output of any command","author":"Lukas Liesis"}},"markdownRemark":{"id":"08e5a956-177b-5c9d-8613-664160847404","excerpt":"Trafikito gets command output from Linux machines as text. While you need to track some part of the text, e.g. you want to monitor an average load while using…","html":"<p>Trafikito gets command output from Linux machines as text. While you need to track some part of the text, e.g. you want to monitor an average load while using uptime command.</p>\n<!--more-->\n<p>This is the sample output of an uptime command:</p>\n<p>16:32:47 up 3 min, 1 user, load average: 2.3, 0.41, 0.19</p>\n<p>You want the <strong>chart</strong> displaying the current value of 2.3 and the change over time. So you have to extract this number. You can do this by splitting the text into a table using delimiters.</p>\n<p>One delimiter is used to split the text into rows and then each row can have the custom delimiter to split it into columns.</p>\n<p>After its finished, you have a table and in some cells your required values. Every minute Trafikito gets new output, splits it into a table using the same delimiters and data is updated.</p>\n<h4>Note:</h4>\n<p>By default Trafikito sets line delimiter to new line symbol, which is: \\n and row delimiter is regular expression [,]+, which splits row into columns by one or more space or comma symbols which is what you need most of the time. You will notice that by default settings most of the time you will have data parsing done automatically.</p>\n<p>When you have a table with data you can create new variables and assign cells. Variables will always hold updated values of specific cells.</p>","frontmatter":{"title":"What is data splitting inside data source configuration?","uri":"what-is-data-splitting-inside-data-source-configuration","tags":["data sources"]}}},"pageContext":{"uri":"what-is-data-splitting-inside-data-source-configuration","previous":{"frontmatter":{"title":"What will happen if I delete a data source which is in use?","uri":"what-will-happen-if-i-delete-a-data-source-which-is-in-use","tags":["data sources"]}},"next":{"frontmatter":{"title":"What happens if I change the data parsing settings?","uri":"what-happens-if-i-change-the-data-parsing-settings","tags":["data sources"]}}}}