{"data":{"site":{"siteMetadata":{"title":"Trafikito - monitor output of any command","author":"Lukas Liesis"}},"markdownRemark":{"id":"535edeb6-8107-51ad-8d91-6ef0ab507c6d","excerpt":"While creating notifications you have to add some  when  cases. When cases defines  when  to trigger the action of notifications. If the action type is set to a…","html":"<p>While creating notifications you have to add some <em>when</em> cases. When cases defines <em>when</em> to trigger the action of notifications. If the action type is set to a <em>Variable in a range</em> you will get these options to make adjustments:</p>\n<p>AAAAAAAAMOREAAAAAAAAAA</p>\n<ol>\n<li><strong>Variable to track</strong> - select any variable defined in the data sources. This when case will track the range of the value for the selected variable.</li>\n<li>\n<p><strong>Range change</strong> - when a value changes it may move to different value ranges. This option determines what changes to action.</p>\n<ol>\n<li>Normal → warn</li>\n<li>Normal → error</li>\n<li>Normal → any</li>\n<li>Warn → normal</li>\n<li>Warn → error</li>\n<li>Warn → any</li>\n<li>Error → normal</li>\n<li>Error → warn</li>\n<li>Error → any</li>\n<li>Any → normal</li>\n<li>Any → warn</li>\n<li>Any → error</li>\n<li>Any → any</li>\n</ol>\n</li>\n<li><strong>Stay in range</strong> - how long to wait for a value to stay in a new range. A value may fluctuate but to avoid short peak values you can use this option. You can select not to wait and fire notifications immediately or wait a few minutes.</li>\n<li><strong>Wait before firing again</strong> - you can select this if you want to fire this action several times when a value continuously stays in a new range or just fire once.</li>\n<li><strong>Allow case to fire at any time</strong> - if it is turned on it will require other when cases to be fired on the same variable before this case can be fired again. It is useful in a scenario when a value jumps from a normal range to a warning or an error, stays there for a very short time and jumps back to a normal range. Notifications about being in the warning/error ranges is not triggered because with stay in range it is set to wait for longer timeframes. So the value jumped back to a normal range and if it is allowed to be fired at any time, it would fire the notification that the value is in the normal range again. Though it would be valid information it’s not necessarily needed since it was just a small value change in a short time.</li>\n</ol>","frontmatter":{"title":"Options when the action type for when cases are variables in ranges?","uri":"options-when-the-action-type-for-when-cases-are-variables-in-ranges","tags":["notifications"]}}},"pageContext":{"uri":"options-when-the-action-type-for-when-cases-are-variables-in-ranges","previous":{"frontmatter":{"title":"What are API call headers?","uri":"what-are-api-call-headers","tags":["notifications"]}},"next":{"frontmatter":{"title":"Options when the action type for the when case is getting or not getting data?","uri":"options-when-the-action-type-for-the-when-case-is-getting-or-not-getting-data","tags":["notifications"]}}}}