{"data":{"site":{"siteMetadata":{"title":"Trafikito - monitor output of any command","author":"Lukas Liesis"}},"markdownRemark":{"id":"044a77dc-26c1-54f5-a721-474f665bfcb6","excerpt":"\r\nWhile creating notifications you have to add when cases. When cases define when to trigger the action of notifications. If the action type is set to _Getting data_ or _Not getting data_ you will get these options to make adjustments:\r\n\r\n","html":"<p>While creating notifications you have to add when cases. When cases define when to trigger the action of notifications. If the action type is set to <em>Getting data</em> or <em>Not getting data</em> you will get these options to make adjustments:</p>\n<!-- more -->\n<ol>\n<li><strong>Getting / not getting for</strong> - select the amount of minutes to wait before it’s considered a real situation. There may be random issues like the network between your server and Trafikito endpoint lags a bit and drops a package. Trafikito agent will try to submit logs several times before giving up, so it may just be a temporary issue and no need to react immediately.</li>\n<li><strong>Wait before firing again</strong> - you can select if you want to fire this action several times or just fire once. Trafikito recommends setting this to <strong>no repeat,</strong> when <strong>type is getting data</strong> and <strong>set to some interval</strong> in minutes <strong>when action type is <em>not getting data</em>.</strong> With such settings only one notification will be fired after recovery and several if Trafikito stops receiving data continuously.</li>\n</ol>","frontmatter":{"title":"Options when the action type for the when case is getting or not getting data?","uri":"options-when-the-action-type-for-the-when-case-is-getting-or-not-getting-data","tags":["notifications"]}}},"pageContext":{"uri":"options-when-the-action-type-for-the-when-case-is-getting-or-not-getting-data","previous":{"frontmatter":{"title":"Options when the action type for when cases are variables in ranges?","uri":"options-when-the-action-type-for-when-cases-are-variables-in-ranges","tags":["notifications"]}},"next":{"frontmatter":{"title":"How to turn off several notifications at once?","uri":"how-to-turn-off-several-notifications-at-once","tags":["notifications"]}}}}