{"data":{"site":{"siteMetadata":{"title":"Trafikito - monitor output of any command","author":"Lukas Liesis"}},"markdownRemark":{"id":"16a8b785-9ad1-53fc-acfc-f68002c0c8c9","excerpt":"\r\nAPI calls are programmable calls for services on the internet. It is very comparable to how people navigate the internet with a browser. However, API calls don’t require a user interface to navigate it. It is pure data, transferable from one machine to another.\r\n\r\n","html":"<p>API calls are programmable calls for services on the internet. It is very comparable to how people navigate the internet with a browser. However, API calls don’t require a user interface to navigate it. It is pure data, transferable from one machine to another.</p>\n<!-- more -->\n<p>You can click “Use email template” to auto-fill all required details to make an API call to Trafikito endpoint which will send an email. If your hosting provider support it, you could make an API call to restart your server when it’s out of RAM.</p>\n<p>Many services do have APIs available. Hosting providers may give you documentation how to restart, create and delete servers with API calls. Services such as Twilio can send SMS or make a phone call using APIs. Most social network sites have APIs to do all kinds of things; from posting new messages to deleting things.</p>\n<p>On the rise of <strong>Internet Of Things</strong> you potentially can take control of autonomous house system using API calls. While Trafikito main target are Linux servers that run web services, you can use Trafikito on any Linux. Even on a smart vacuum cleaner that runs a Linux inside to operate. Trafikito can make API calls to open or close doors connected to the internet, when the vacuum cleaner is done with one area. All depends where you will install the agent and how you will setup custom API calls.</p>\n<p>In short, with API calls you can do almost anything you can do with a computer automatically. There’s no need for a person to click on things for actions to occur. Ask your service provider if they have APIs available.</p>","frontmatter":{"title":"What is an API call?","uri":"what-is-an-api-call","tags":["notifications"]}}},"pageContext":{"uri":"what-is-an-api-call","previous":{"frontmatter":{"title":"What is the difference between action types- getting data, not getting data and variable in ranges?","uri":"what-is-the-difference-between-action-types-getting-data-not-getting-data-and-variable-in-ranges","tags":["notifications"]}},"next":{"frontmatter":{"title":"What is a notification action method?","uri":"what-is-a-notification-action-method","tags":["notifications"]}}}}