{"data":{"site":{"siteMetadata":{"title":"Trafikito - monitor output of any command","author":"Lukas Liesis"}},"markdownRemark":{"id":"fd96003e-235c-5eac-9147-6c298a8a432d","excerpt":"Go to single server view where you can see the box with text. Turn on the edit mode switch, which is on the bottom left of the single server view. Now you can…","html":"<ol>\n<li>Go to single server view where you can see the box with text.</li>\n<li>Turn on the edit mode switch, which is on the bottom left of the single server view. Now you can view settings of any box, drag boxes around, add new or remove current.</li>\n<li>To edit a specific text, click the pencil icon on that box. Dialog with settings appear.</li>\n<li>Make sure the Text tab is selected on the top section of the dialog.</li>\n<li>Add any text together with variables. You can format text with available tools over the input. All available variables are on the bottom of the dialog. Click on any to copy and paste it as normal text into the input. Variables must be surrounded by pairs of curly braces like this: <code class=\"language-text\">{{variable_name}}</code>.</li>\n<li>Click save on the bottom right.</li>\n<li>Close the settings dialog with the button on the top right side of the dialog.</li>\n<li>Switch edit mode off.</li>\n</ol>\n<!--more-->\n<p>How variables are rendered depends on the variable display type. It may be a string, number, base or percent.</p>\n<h4>Notes:</h4>\n<ol>\n<li>Don’t forget to click <strong>Save</strong></li>\n<li>Changes will be applied to all members of the workspace.</li>\n<li>To save any changes you must have an admin or owner role in an active workspace.</li>\n</ol>","frontmatter":{"title":"How to change text in dashboard?","uri":"how-to-change-text-in-dashboard","tags":["dashboard"]}}},"pageContext":{"uri":"how-to-change-text-in-dashboard","previous":{"frontmatter":{"title":"What is a notification url?","uri":"what-is-a-notification-url","tags":["notifications"]}},"next":{"frontmatter":{"title":"How to change y-axis of the chart?","uri":"how-to-change-y-axis-of-the-chart","tags":["dashboard"]}}}}