{"data":{"site":{"siteMetadata":{"title":"Trafikito - monitor output of any command","author":"Lukas Liesis"}},"markdownRemark":{"id":"5968edb5-d451-528a-9676-be2794a9c424","excerpt":"Display type base can be used with numeric values. It can do some basic math and apply suffix to the final number. This is how it works: Let’s say we use df -P…","html":"<p>Display type base can be used with numeric values. It can do some basic math and apply suffix to the final number. This is how it works:</p>\n<!--more-->\n<p>Let’s say we use df -P command to get the available disk space and the current value is <strong>3977700</strong>. It means there are <strong>3977700 Kilobytes</strong> left. It is useful to have the raw value to display it on a chart but on a text box it would be better to have a formatted value.</p>\n<p>You can set Base as <strong>1024</strong> and add a few names. We will use KB, MB, GB and TB for now. Trafikito will take the raw value of <strong>3977700</strong> and divide it by <strong>1024</strong>:</p>\n<p>3977700 / 1024 = 3884.47265625</p>\n<p>While <strong>3884</strong> is more then <strong>1024</strong>, it will be divided again:</p>\n<p>3884.47265625 / 1024 = 3.7934303284</p>\n<p>Now you have decimal places option - how many numbers to show in decimal places. If it is set to <strong>2</strong>, final formatted value will be <strong>3.79</strong> and while it was divided <strong>2</strong> times, the 3rd value name will be used, which in our case is GB. So the final render with suffix is: 3.79 GB</p>","frontmatter":{"title":"How does options of the display type: base work?","uri":"how-does-options-of-the-display-type-base-work","tags":["data sources"]}}},"pageContext":{"uri":"how-does-options-of-the-display-type-base-work","previous":{"frontmatter":{"title":"How to add a new command?","uri":"how-to-add-a-new-command","tags":["data sources"]}},"next":{"frontmatter":{"title":"Can I have several variables showing the same thing?","uri":"can-i-have-several-variables-showing-the-same-thing","tags":["data sources"]}}}}