{"data":{"site":{"siteMetadata":{"title":"Trafikito - monitor output of any command","author":"Lukas Liesis"}},"markdownRemark":{"id":"a12028a2-6435-5b16-8388-7094c3fb2d00","excerpt":"Go to single server view where you can see the box with the chart. Turn on the edit mode switch, which is on the bottom left of single server view. Now you can…","html":"<ol>\n<li>Go to single server view where you can see the box with the chart.</li>\n<li>Turn on the edit mode switch, which is on the bottom left of single server view. Now you can view settings of any box, drag boxes around, add new or remove current.</li>\n<li>To edit a specific t chart, click the pencil icon on it. Dialog with settings appear.</li>\n<li>Scroll down to the “Optional settings” section and edit the min or max value of y-axis. You can use numbers together with any variables. Variables must be surrounded by pairs of curly braces like this: <code class=\"language-text\">{{variable_name}}</code>. Variables will be replaced with the current value. On the bottom of the same view you can see a cloud of chips with all variables. Click any to copy and paste it in the settings field. When a variable is pasted in options, an input preview will be rendered of the current value above the input.</li>\n<li>Click save on the bottom right hand corner.</li>\n<li>Close the settings dialog with the button on the top right of the dialog.</li>\n<li>Switch edit mode off.</li>\n</ol>\n<!--more-->\n<p>While adding variables in the y-axis for the min or max values, you can see a rendered preview with the current value of the variable. How variables are rendered depends on the variable display type.</p>\n<h4>Notes:</h4>\n<ul>\n<li>Don’t forget to click “Save”</li>\n<li>Changes will be applied to all members of the workspace.</li>\n<li>To save any changes you must have an admin or owner role in an active workspace.</li>\n</ul>","frontmatter":{"title":"How to change y-axis of the chart?","uri":"how-to-change-y-axis-of-the-chart","tags":["dashboard"]}}},"pageContext":{"uri":"how-to-change-y-axis-of-the-chart","related":[{"post":{"excerpt":"Yes  Trafikito is fully compatible with phones and tablets. However,  when making customizations,  we recommend using a computer but it’s…","frontmatter":{"title":"Can I view the dashboard on my phone or tablet?","uri":"can-i-view-the-dashboard-on-my-phone-or-tablet","tags":["dashboard"]}},"matchedTags":["dashboard"]},{"post":{"excerpt":"For hobby projects 12 hours is more than enough. With 12 hours you can see what happened while you were sleeping.\n However, for most…","frontmatter":{"title":"How many hours of logs do I need?","uri":"how-many-hours-of-logs-do-i-need","tags":["dashboard"]}},"matchedTags":["dashboard"]},{"post":{"excerpt":"Trafikito’s dashboard data, including server list and single server views, are continuously being refreshed in the background. A data…","frontmatter":{"title":"How often is the data in Trafikito’s dashboard updated?","uri":"how-often-is-the-data-in-trafikito-s-dashboard-updated","tags":["dashboard"]}},"matchedTags":["dashboard"]},{"post":{"excerpt":"Go to the single server view where you can see the box with text. Turn on the edit mode switch, which is on the bottom left of the single…","frontmatter":{"title":"How to change color of the chart?","uri":"how-to-change-color-of-the-chart","tags":["dashboard"]}},"matchedTags":["dashboard"]},{"post":{"excerpt":"Go to the single server view where you can see the box with text. Turn on the edit mode switch, which is on the bottom left of the single…","frontmatter":{"title":"How to change default visibility on charts?","uri":"how-to-change-default-visibility-on-charts","tags":["dashboard"]}},"matchedTags":["dashboard"]},{"post":{"excerpt":"Go to single server view where you can see the box with text. Turn on the edit mode switch, which is on the bottom left of the single server…","frontmatter":{"title":"How to change text in dashboard?","uri":"how-to-change-text-in-dashboard","tags":["dashboard"]}},"matchedTags":["dashboard"]},{"post":{"excerpt":"Go to the single server view where you will see a number of charts displayed. Turn on the edit mode switch, which is in the bottom-left…","frontmatter":{"title":"How to change the layout of the dashboard?","uri":"how-to-change-the-layout-of-the-dashboard","tags":["dashboard"]}},"matchedTags":["dashboard"]},{"post":{"excerpt":"Go to single server view where you can see the box with the chart. Turn on the edit mode switch, which is on the bottom left of single…","frontmatter":{"title":"How to change the title or y-axis of the chart?","uri":"how-to-change-the-title-or-y-axis-of-the-chart","tags":["dashboard"]}},"matchedTags":["dashboard"]},{"post":{"excerpt":"Go to single server view where you can see the box with the chart. Turn on the edit mode switch, which is on the bottom left of single…","frontmatter":{"title":"How to change y-axis of the chart?","uri":"how-to-change-y-axis-of-the-chart","tags":["dashboard"]}},"matchedTags":["dashboard"]},{"post":{"excerpt":"Go to single server view where you can see the chart. Turn on the edit mode switch, which is on the bottom left of single server view. Now…","frontmatter":{"title":"How to edit the text or chart box in single server view?","uri":"how-to-edit-the-text-or-chart-box-in-single-server-view","tags":["dashboard"]}},"matchedTags":["dashboard"]},{"post":{"excerpt":"In the single server view above all boxes with text and charts there is an option to select how many hours to view\nby using the arrows to…","frontmatter":{"title":"How to navigate in time?","uri":"how-to-navigate-in-time","tags":["dashboard"]}},"matchedTags":["dashboard"]},{"post":{"excerpt":"Go to single server view where you can see the boxes with text and charts Turn on the edit mode switch, which is on the bottom left of the…","frontmatter":{"title":"How to remove boxes from the dashboard?","uri":"how-to-remove-boxes-from-the-dashboard","tags":["dashboard"]}},"matchedTags":["dashboard"]},{"post":{"excerpt":"While in the single server view with boxes of text and charts, scroll all the way up to where there is a button \nwith the current selected…","frontmatter":{"title":"How to switch server on the single server view without going back to the servers list?","uri":"how-to-switch-server-on-the-single-server-view-without-going-back-to-the-servers-list","tags":["dashboard"]}},"matchedTags":["dashboard"]},{"post":{"excerpt":"The Free plan allows you to view up to 12 hours of logs. Paid plans allows up to  2 weeks of logs.  \nWhile in the single server view, click…","frontmatter":{"title":"How to view more than 1 hour of logs?","uri":"how-to-view-more-than-1-hour-of-logs","tags":["dashboard"]}},"matchedTags":["dashboard"]},{"post":{"excerpt":"The servers list is a place where you can see an overview of all your servers. It is an initial view of the dashboard.\nTo open the servers…","frontmatter":{"title":"What are the servers list view on Trafikito dashboard?","uri":"what-are-the-servers-list-view-on-trafikito-dashboard","tags":["dashboard"]}},"matchedTags":["dashboard"]},{"post":{"excerpt":"A single view layout is fully customizable. It reports whatever makes sense in your case. During installation, Trafikito \ntries to retrieve…","frontmatter":{"title":"What data is displayed in the single server view of Trafikito’s dashboard?","uri":"what-data-is-displayed-in-the-single-server-view-of-trafikito-s-dashboard","tags":["dashboard"]}},"matchedTags":["dashboard"]},{"post":{"excerpt":"During installation, Trafikito will try to get details about all your server’s base resources and generate a dashboard for you. By default…","frontmatter":{"title":"What is available in the default single server view?","uri":"what-is-available-in-the-default-single-server-view","tags":["dashboard"]}},"matchedTags":["dashboard"]},{"post":{"excerpt":"Edit mode is a special mode which enables the editing of a single server view. In this mode, you can add, edit, remove or drag boxes around…","frontmatter":{"title":"What is edit mode?","uri":"what-is-edit-mode","tags":["dashboard"]}},"matchedTags":["dashboard"]},{"post":{"excerpt":"This view has extended details of the variables being monitored on your server. It can have several types of boxes. \nBoxes with text show…","frontmatter":{"title":"What is single server view on Trafikito dashboard?","uri":"what-is-single-server-view-on-trafikito-dashboard","tags":["dashboard"]}},"matchedTags":["dashboard"]},{"post":{"excerpt":"A dashboard is a special place where you can see an overview of all your servers in a workspace. You can extensively\ncheck logs over time…","frontmatter":{"title":"What is Trafikito’s Dashboard?","uri":"what-is-trafikito-s-dashboard","tags":["dashboard"]}},"matchedTags":["dashboard"]},{"post":{"excerpt":"A dashboard is an essential part of Trafikito’s web interface. It shows the current status of your servers in addition\nto log information…","frontmatter":{"title":"Why is the dashboard important?","uri":"why-is-the-dashboard-important","tags":["dashboard"]}},"matchedTags":["dashboard"]}]}}